Enums/ВариантыНавигацииВФормахНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыНавигацииВФормахНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИерархии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидам</Name>
					<Comment>Синоним должен быть как имя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВидамИСвойствам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСвойствам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПодборНоменклатурыСИЗКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОберткиДляОпределенияТипаФормПодборов

// Проверяет, является ли формой выбора справочника "Характеристики номенклатуры".
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма.
//
// Возвращаемое значение:
//	Булево - истина, если это форма выбора характеристики.
//
Функция ЭтоФормаВыбораХарактеристик(Форма) Экспорт
	
	Возврат (Форма.КодФормы = "Справочник_ХарактеристикиНоменклатуры_ФормаВыбора");
	
КонецФункции

// Проверяет, является ли формой выбора справочника "Номенклатура".
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма.
//
// Возвращаемое значение:
//	Булево - истина, если это форма выбора номенклатуры.
//
Функция ЭтоФормаВыбораНоменклатуры(Форма) Экспорт
	
	Возврат (Форма.КодФормы = "Справочник_Номенклатура_ФормаВыбора");
	
КонецФункции

// Проверяет, является ли формой списка справочника "Номенклатура".
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма.
//
// Возвращаемое значение:
//	Булево - Истина, если это форма списка номенклатуры.
//
Функция ЭтоФормаСпискаНоменклатуры(Форма) Экспорт
	
	Возврат (Форма.КодФормы = "Справочник_Номенклатура_ФормаСписка");
	
КонецФункции

#КонецОбласти

#Область ФункцииУстановкиИСбросаОтборов

// Устанавливает отбор по группе номенклатуры в списке номенклатуры.
// Если на форме используется вариант навигации отличный от навигации по иерархии,
// то отбор не устанавливается.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура УстановитьОтборПоИерархииНоменклатуры(Форма) Экспорт
	
	Если Не Форма.ИспользоватьФильтры Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии") Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоИерархииНоменклатуры = Форма.ТекущаяИерархияНоменклатуры;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокНоменклатура,
																			"Родитель",
																			ОтборПоИерархииНоменклатуры,
																			ВидСравненияКомпоновкиДанных.Равно,
																			"Родитель",
																			Истина);
	
КонецПроцедуры

// Отключает установленный отбор по группе номенклатуры у списка номенклатуры
// на форме подбора.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура УдалитьОтборПоИерархииНоменклатуры(Форма) Экспорт
	
	Если Не ЭтоФормаВыбораХарактеристик(Форма) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.СписокНоменклатура, "Родитель",,,,Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаОтображенияФормыПоВариантуПоиска

// Устанавливает кнопку выбора по умолчанию в форме выбора номенклатуры в зависимости от варианта поиска.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры, форма выбора, форма подбора.
//
Процедура НазначитьКнопкуВыбораПоУмолчанию(Форма) Экспорт
	Форма.Элементы.СписокНоменклатураВыбратьЗначениеНоменклатуры.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Устанавливает значения доступности элементов фильтров в зависимости от значения
// флажка использования фильтров.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора
//
Процедура УстановитьДоступностьЭлементовФильтров(Форма) Экспорт
	
	ЭтоФормаВыбораХарактеристик = ЭтоФормаВыбораХарактеристик(Форма);
	
	Если Не ЭтоФормаВыбораХарактеристик Тогда
		ИспользоватьФильтры = Форма.ИспользоватьФильтры;
		
		ОтборПоСИЗ = Неопределено;
		ОтборПоВидуНоменклатуры = Неопределено;
		Если ЭтоФормаВыбораНоменклатуры(Форма) И (Форма.Параметры.Свойство("ОтборПоСИЗ", ОтборПоСИЗ) И ЗначениеЗаполнено(ОтборПоСИЗ)
			Или Форма.Параметры.Свойство("ОтборПоВидуНоменклатуры", ОтборПоВидуНоменклатуры) И ЗначениеЗаполнено(ОтборПоВидуНоменклатуры)) Тогда
			
			ИспользоватьФильтры = Ложь;
			Форма.Элементы.ГруппаФильтрыНоменклатуры.Доступность = Ложь;
		КонецЕсли;
	
		Форма.Элементы.ИерархияНоменклатуры.Доступность = ИспользоватьФильтры;
		Форма.Элементы.ВидыНоменклатуры.Доступность = ИспользоватьФильтры;
		Форма.Элементы.ВидНоменклатуры.Доступность = ИспользоватьФильтры;
		Форма.Элементы.ДеревоОтборов.Доступность = Форма.ИспользоватьФильтры;
		Форма.Элементы.КоманднаяПанельВариантНавигации.Доступность = ИспользоватьФильтры;
		
		Если Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам")
			Или Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам")
			Или Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидам") Тогда
			Форма.Элементы.НадписьВариантНавигации.Доступность = ИспользоватьФильтры;
		КонецЕсли;
	Иначе
		Форма.Элементы.ДеревоОтборов.Доступность = Форма.ИспользоватьФильтры;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
